problem link: https://leetcode.com/problems/consecutive-numbers/description/?lang=pythondata

In [1]:
import pandas as pd

### Generating test cases

In [11]:
scores=pd.read_csv('./test_data/logs_test1_p180.csv',delimiter='|')
scores

   id  num
0   1    1
1   2    1
2   3    1
3   4    2
4   5    1
5   6    2
6   7    2

In [3]:
scores.dtypes

id     int64
num    int64
dtype: object

In [4]:
scores.columns

Index(['id', 'num'], dtype='object')

### Solving problem

In [12]:
scores

   id  num
0   1    1
1   2    1
2   3    1
3   4    2
4   5    1
5   6    2
6   7    2

In [13]:
scores['lead1']=scores.num.shift(-1)   #lead operation
scores['lead2']=scores.lead1.shift(-1)   #lead operation
scores

   id  num  lead1  lead2
0   1    1    1.0    1.0
1   2    1    1.0    2.0
2   3    1    2.0    1.0
3   4    2    1.0    2.0
4   5    1    2.0    2.0
5   6    2    2.0    NaN
6   7    2    NaN    NaN

In [19]:
scores=scores[(scores.num==scores.lead1) & (scores.lead1==scores.lead2)]    #getting consecutive numbers
scores

   id  num  lead1  lead2
0   1    1    1.0    1.0

In [22]:
pd.DataFrame(scores.num.rename('ConsecutiveNums'))

   ConsecutiveNums
0                1

### Preparing Submission function

In [27]:
import pandas as pd

def consecutive_numbers(logs: pd.DataFrame) -> pd.DataFrame:
    logs['lead1']=logs.num.shift(-1)   #lead operation
    logs['lead2']=logs.lead1.shift(-1)   #lead operation
    logs=logs[(logs.num==logs.lead1) & (logs.lead1==logs.lead2)]    #getting consecutive numbers
    
    return pd.DataFrame(logs.num.rename('ConsecutiveNums'))

### Testing the submission function

In [24]:
scores=pd.read_csv('./test_data/logs_test1_p180.csv',delimiter='|')
scores

   id  num
0   1    1
1   2    1
2   3    1
3   4    2
4   5    1
5   6    2
6   7    2

In [28]:
consecutive_numbers(logs=scores)

   ConsecutiveNums
0                1